In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn

In [3]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['AB','CD','FG','HI'])

In [4]:
df

         AB        CD        FG        HI
A  0.434600 -1.800404 -0.259962  0.780062
B -0.678323  0.320764  0.913706  0.779771
C -0.384556  2.382969  0.005426 -0.346246
D  1.577682  1.509592 -0.559129 -2.271315
E -0.725429 -0.307246  1.102827  1.973957

In [6]:
booldf = df > 0

In [8]:
booldf #Boolean DataFrame

      AB     CD     FG     HI
A   True  False  False   True
B  False   True   True   True
C  False   True   True  False
D   True   True  False  False
E  False  False   True   True

In [9]:
df[booldf]

         AB        CD        FG        HI
A  0.434600       NaN       NaN  0.780062
B       NaN  0.320764  0.913706  0.779771
C       NaN  2.382969  0.005426       NaN
D  1.577682  1.509592       NaN       NaN
E       NaN       NaN  1.102827  1.973957

In [10]:
df[df>0]

         AB        CD        FG        HI
A  0.434600       NaN       NaN  0.780062
B       NaN  0.320764  0.913706  0.779771
C       NaN  2.382969  0.005426       NaN
D  1.577682  1.509592       NaN       NaN
E       NaN       NaN  1.102827  1.973957

In [11]:
df

         AB        CD        FG        HI
A  0.434600 -1.800404 -0.259962  0.780062
B -0.678323  0.320764  0.913706  0.779771
C -0.384556  2.382969  0.005426 -0.346246
D  1.577682  1.509592 -0.559129 -2.271315
E -0.725429 -0.307246  1.102827  1.973957

In [18]:
df.loc['A'] > 0  #Jika ambil data rows, Menggunakan keyword loc[]

AB     True
CD    False
FG    False
HI     True
Name: A, dtype: bool

In [26]:
df['AB'] > 0

A     True
B    False
C    False
D     True
E    False
Name: AB, dtype: bool

In [27]:
resultDF = df[df['AB']>0]